; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	image0 - mode
	spectrograph1 - mode
	image2 - mode
	GroundStation2 - direction
	Star0 - direction
	Star4 - direction
	Star1 - direction
	GroundStation3 - direction
	Phenomenon5 - direction
	Star6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 image2)
	(supports instrument1 image0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet13)
	(supports instrument3 image2)
	(supports instrument3 image0)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 image0)
	(supports instrument4 image2)
	(calibration_target instrument4 Star0)
	(supports instrument5 image0)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 Star4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 GroundStation3)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon5)
	(supports instrument7 image0)
	(supports instrument7 spectrograph1)
	(calibration_target instrument7 Star1)
	(supports instrument8 image2)
	(calibration_target instrument8 GroundStation3)
	(supports instrument9 spectrograph1)
	(supports instrument9 image0)
	(calibration_target instrument9 GroundStation3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star4)
)
(:goal (and
	(pointing satellite1 Planet15)
	(pointing satellite3 Star4)
	(have_image Phenomenon5 image2)
	(have_image Star6 image0)
	(have_image Planet7 spectrograph1)
	(have_image Phenomenon8 image0)
	(have_image Star9 spectrograph1)
	(have_image Phenomenon10 spectrograph1)
	(have_image Phenomenon11 spectrograph1)
	(have_image Planet12 image0)
	(have_image Planet13 image0)
	(have_image Phenomenon14 image0)
	(have_image Planet15 image2)
	(have_image Star16 spectrograph1)
))

)

; plan
1. (turn_to satellite1 groundstation2 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 groundstation2)
   goals met: 1 of 14
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 14
3. (calibrate satellite1 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 1 of 14
4. (turn_to satellite1 phenomenon8 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon8)
   goals met: 1 of 14
5. (take_image satellite1 phenomenon8 instrument3 image0)
   added: (have_image phenomenon8 image0)
   goals met: 2 of 14
6. (turn_to satellite1 phenomenon5 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon5)
   goals met: 2 of 14
7. (take_image satellite1 phenomenon5 instrument3 image2)
   added: (have_image phenomenon5 image2)
   goals met: 3 of 14
8. (turn_to satellite1 phenomenon14 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 phenomenon14)
   goals met: 3 of 14
9. (take_image satellite1 phenomenon14 instrument3 image0)
   added: (have_image phenomenon14 image0)
   goals met: 4 of 14
10. (turn_to satellite1 phenomenon11 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon11)
   goals met: 4 of 14
11. (take_image satellite1 phenomenon11 instrument3 spectrograph1)
   added: (have_image phenomenon11 spectrograph1)
   goals met: 5 of 14
12. (turn_to satellite1 phenomenon10 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 phenomenon10)
   goals met: 5 of 14
13. (take_image satellite1 phenomenon10 instrument3 spectrograph1)
   added: (have_image phenomenon10 spectrograph1)
   goals met: 6 of 14
14. (turn_to satellite1 planet12 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet12)
   goals met: 6 of 14
15. (take_image satellite1 planet12 instrument3 image0)
   added: (have_image planet12 image0)
   goals met: 7 of 14
16. (turn_to satellite1 planet13 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet13)
   goals met: 7 of 14
17. (take_image satellite1 planet13 instrument3 image0)
   added: (have_image planet13 image0)
   goals met: 8 of 14
18. (turn_to satellite1 planet7 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet7)
   goals met: 8 of 14
19. (take_image satellite1 planet7 instrument3 spectrograph1)
   added: (have_image planet7 spectrograph1)
   goals met: 9 of 14
20. (turn_to satellite1 star16 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star16)
   goals met: 9 of 14
21. (take_image satellite1 star16 instrument3 spectrograph1)
   added: (have_image star16 spectrograph1)
   goals met: 10 of 14
22. (turn_to satellite1 star6 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 star6)
   goals met: 10 of 14
23. (take_image satellite1 star6 instrument3 image0)
   added: (have_image star6 image0)
   goals met: 11 of 14
24. (turn_to satellite1 star9 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star9)
   goals met: 11 of 14
25. (take_image satellite1 star9 instrument3 spectrograph1)
   added: (have_image star9 spectrograph1)
   goals met: 12 of 14
26. (turn_to satellite1 planet15 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 planet15)
   goals met: 13 of 14
27. (take_image satellite1 planet15 instrument3 image2)
   added: (have_image planet15 image2)
   goals met: 14 of 14
